# OBJImportOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
OBJImportOptions Class
Members See Also
---
The import options used to import OBJ format files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public class OBJImportOptions : BaseImportOptions
```

Visual Basic
---
```text
Public Class OBJImportOptions _
	Inherits BaseImportOptions
```

Visual C++
---
```text
public ref class OBJImportOptions : public BaseImportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BaseImportOptions Autodesk.Revit.DB..::..OBJImportOptions
# See Also
OBJImportOptions Members
Autodesk.Revit.DB Namespace